let num = 30
for (let i=0; i<=num; i++) {
  if (num%i === 0) {
    console.log(i)
  }
}


/* 

let num = 30
for (i from 1 to 30) do
  if (num%i === 0) do
    print i
  end if
end for

*/

/* 

let num = 30
2. 進入迴圈，i 從 0 跑到 30
3. i = 1
4. 判斷 1 可不可以被 30 整除 => true
5. 印出 i => 1 
6. 下一圈迴圈
7. i = 2
8. 判斷 2 可不可以被 30 整除 => true
9. 印出 i => 2
10. 下一圈迴圈
11. i = 3
12. 判斷 3 可不可以被 30 整除 => true
13. 印出 i => 3
14. 下一圈迴圈
15. i = 4
16. 判斷 4 可不可以被 30 整除 => false
17. 下一圈迴圈
18. i = 5
19. 判斷 5 可不可以被 30 整除 => true
20. 印出 i => 5
21. 下一圈迴圈
22. i = 6
23. 判斷 6 可不可以被 30 整除 => true
24. 印出 i => 6
25. 下一圈迴圈
26. i = 7
27. 判斷 7 可不可以被 30 整除 => false
28. 下一圈迴圈
29. i = 8
30. 判斷 8 可不可以被 30 整除 => false
31. 下一圈迴圈
32. i = 9
33. 判斷 9 可不可以被 30 整除 => false
34. 下一圈迴圈
35. i = 10
36. 判斷 10 可不可以被 30 整除 => true
37. 印出 i => 10
38. 下一圈迴圈
39. i = 11
40. 判斷 11 可不可以被 30 整除 => false
41. 下一圈迴圈
42. i = 12
43. 判斷 12 可不可以被 30 整除 => false
44. 下一圈迴圈
45. i = 13
46. 判斷 13 可不可以被 30 整除 => false
47. 下一圈迴圈
48. i = 14
49. 判斷 14 可不可以被 30 整除 => false
50. 下一圈迴圈
51. i = 15
52. 判斷 15 可不可以被 30 整除 => true
53. 印出 i => 15
54. 下一圈迴圈
55. i = 16
56. 判斷 16 可不可以被 30 整除 => false
57. 下一圈迴圈
58. i = 17
59. 判斷 17 可不可以被 30 整除 => false
60. 下一圈迴圈
61. i = 18
62. 判斷 18 可不可以被 30 整除 => false
63. 下一圈迴圈
64. i = 19
65. 判斷 19 可不可以被 30 整除 => false
66. 下一圈迴圈
67. i = 20
68. 判斷 20 可不可以被 30 整除 => false
69. 下一圈迴圈
70. i = 21
71. 判斷 21 可不可以被 30 整除 => false
72. 下一圈迴圈
73. i = 22
74. 判斷 22 可不可以被 30 整除 => false
75. 下一圈迴圈
76. i = 23
77. 判斷 23 可不可以被 30 整除 => false
78. 下一圈迴圈
79. i = 24
80. 判斷 24 可不可以被 30 整除 => false
81. 下一圈迴圈
82. i = 25
83. 判斷 25 可不可以被 30 整除 => false
84. 下一圈迴圈
85. i = 26
86. 判斷 26 可不可以被 30 整除 => false
87. 下一圈迴圈
88. i = 27
89. 判斷 27 可不可以被 30 整除 => false
90. 下一圈迴圈
91. i = 28
92. 判斷 28 可不可以被 30 整除 => false
93. 下一圈迴圈
94. i = 29
95. 判斷 29 可不可以被 30 整除 => false
96. 下一圈迴圈
97. i = 30
98. 判斷 30 可不可以被 30 整除 => true
99. 印出 i =>30
100. 下一圈迴圈
101. i = 31，不符合條件，結束迴圈
102. 執行完畢

 */